In [11]:
import pymysql
import pandas as pd

In [12]:
db = pymysql.connect("mysql","root","1234","ntuhs" )
cursor = db.cursor()

In [13]:
#salary bins in departments with counting
sql = "SELECT bins, dept_name, count(*) AS cnt FROM (\
            SELECT CASE WHEN (salary >= 30000 and salary < 45000) THEN '30000_45000'\
                        WHEN (salary >= 45000 and salary < 60000) THEN '45000_60000'\
                        WHEN (salary >= 60000 and salary < 75000) THEN '60000_75000'\
                        WHEN (salary >= 75000 and salary < 90000) THEN '75000_90000'\
                        WHEN (salary >= 90000 and salary < 105000) THEN '90000_105000'\
                        WHEN (salary >= 105000 and salary < 120000) THEN '105000_120000'\
                   END  as bins, a.emp_no, c.dept_name\
            FROM (\
              SELECT emp_no, max(salary) AS salary\
              FROM ntuhs.salaries GROUP BY emp_no\
            ) a\
       JOIN ntuhs.dept_emp b\
       JOIN ntuhs.departments c\
       ON a.emp_no = b.emp_no and b.dept_no = c.dept_no\
       ) d\
       GROUP BY bins, dept_name"

In [14]:
cursor.execute(sql)
df = pd.DataFrame(cursor.fetchall())

#rename column
df = df.rename(columns={0: "bins", 1: "dept_name", 2:"cnt"})

In [15]:
df.sort_values(by=['dept_name','cnt'])

             bins           dept_name  cnt
11    60000_75000    Customer Service    1
25   90000_105000    Customer Service    2
4     45000_60000    Customer Service    3
1     30000_45000         Development    2
26   90000_105000         Development    2
20    75000_90000         Development    6
5     45000_60000         Development    9
12    60000_75000         Development   13
13    60000_75000             Finance    1
27   90000_105000             Finance    3
28   90000_105000     Human Resources    2
6     45000_60000     Human Resources    3
14    60000_75000     Human Resources    5
15    60000_75000           Marketing    1
29   90000_105000           Marketing    2
2     30000_45000          Production    1
30   90000_105000          Production    2
7     45000_60000          Production    4
16    60000_75000          Production    8
21    75000_90000          Production    8
8     45000_60000  Quality Management    1
17    60000_75000  Quality Management    1
31   90000_105000  Quality Management    1
22    75000_90000  Quality Management    3
3     30000_45000            Research    1
32   90000_105000            Research    1
23    75000_90000            Research    2
9     45000_60000            Research    3
18    60000_75000            Research    4
0   105000_120000               Sales    1
10    45000_60000               Sales    1
19    60000_75000               Sales    2
24    75000_90000               Sales    6
33   90000_105000               Sales    6

In [16]:
df.to_csv('salary_bins.csv', index=False)

In [18]:
from sqlalchemy import create_engine
from sqlalchemy.types import NVARCHAR, Float, Integer

conn = create_engine('mysql+pymysql://root:1234@mysql:3306/ntuhs?charset=utf8')

In [19]:
sql = "select a.emp_no, year(CURDATE())-year(birth_date) as age, salary, gender\
       from (select distinct emp_no from ntuhs.dept_emp) a\
       join (select emp_no, max(salary) as salary FROM ntuhs.salaries group by emp_no) b\
       join ntuhs.employees c\
       on a.emp_no = b.emp_no and a.emp_no = c.emp_no"

In [20]:
cursor.execute(sql)
df = pd.DataFrame(cursor.fetchall())

#rename column
df = df.rename(columns={0: "emp_no", 1: "age", 2: "salary", 3: "gender"})

In [22]:
df.to_sql(name='salary_gender', con=conn, if_exists='append', index=False)

In [23]:
cursor.close()
db.close()